In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import numpy as np
import pandas as pd
from pathlib import Path
from collections import Counter

## Read the CSV and Perform Basic Data Cleaning

In [3]:
# Load the file
file_path = Path('NYC_restaurants_full_dataset.csv')

In [4]:
# Read into a dataFrame
df = pd.read_csv(file_path)

In [5]:
# Show dataFrame
df

,DBA,STREET,INCOME_LEVEL,CUISINE_DESCRIPTION,SCORE,GRADE
0,(LEWIS DRUG STORE) LOCANDA VINI E OLII,GATES AVENUE,medium income,Italian,2,A
1,(LEWIS DRUG STORE) LOCANDA VINI E OLII,GATES AVENUE,medium income,Italian,9,A
2,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,11,A
3,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,12,A
4,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,11,A
...,...,...,...,...,...,...
33688,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,11,A
33689,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,11,A
33690,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A
33691,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A
33692,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A

In [6]:
# Show df's first 5 rows only
df.head()

,DBA,STREET,INCOME_LEVEL,CUISINE_DESCRIPTION,SCORE,GRADE
0,(LEWIS DRUG STORE) LOCANDA VINI E OLII,GATES AVENUE,medium income,Italian,2,A
1,(LEWIS DRUG STORE) LOCANDA VINI E OLII,GATES AVENUE,medium income,Italian,9,A
2,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,11,A
3,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,12,A
4,(PUBLIC FARE) 81st street and central park wes...,CENTRAL PARK WEST,high income,American,11,A

In [7]:
# Show df's first 5 rows and last 5 rows only
df.tail()

,DBA,STREET,INCOME_LEVEL,CUISINE_DESCRIPTION,SCORE,GRADE
33688,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,11,A
33689,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,11,A
33690,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A
33691,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A
33692,ZUCKER'S BAGELS AND SMOKED FISH,CHAMBERS STREET,high income,Bagels/Pretzels,12,A

In [8]:
# Determine missing values: Count values in each column
df.count()

DBA                    33693
STREET                 33693
INCOME_LEVEL           33693
CUISINE_DESCRIPTION    33693
SCORE                  33693
GRADE                  33693
dtype: int64

In [12]:
# Determine missing values: isnull().sum()
df.isnull().sum()

DBA                    0
STREET                 0
INCOME_LEVEL           0
CUISINE_DESCRIPTION    0
SCORE                  0
GRADE                  0
dtype: int64

In [9]:
# Get the names of all columns
df.columns

Index(['DBA', 'STREET', 'INCOME_LEVEL', 'CUISINE_DESCRIPTION', 'SCORE',
       'GRADE'],
      dtype='object')

In [10]:
# Set the variables 'columns' and 'target', containing features varaibles and target variables respectively
columns = ['DBA', 'STREET', 'INCOME_LEVEL', 'CUISINE_DESCRIPTION', 'SCORE']

target = ['GRADE']

In [11]:
# Check data types
datatypes = df.dtypes
print(datatypes)

DBA                    object
STREET                 object
INCOME_LEVEL           object
CUISINE_DESCRIPTION    object
SCORE                   int64
GRADE                  object
dtype: object

In [18]:
# Determine unique values in the column "INCOME_LEVEL"

## Get a variable holding a list made out of values in "INCOME_LEVEL"
income_types = df["INCOME_LEVEL"].tolist()
## Get the unique items in the "income_types" list
set(income_types)

{'high income', 'low income', 'medium income'}

In [20]:
# Determine unique values in the column "GRADE"

## Get a variable holding a list made out of values in "INCOME_LEVEL"
grade_types = df["GRADE"].tolist()
## Get the unique items in the "income_types" list
set(grade_types)

{'A', 'B', 'C', 'P', 'Z'}